# Core tools
brew "bat"
brew "btop"
brew "delta"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "lazygit"
brew "lsd"
brew "mise"
brew "pi-coding-agent"
brew "neovim"
brew "nnn"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree-sitter"
brew "tldr"
brew "trash"
brew "uv"
brew "wget"
brew "wireshark"
brew "zoxide"
brew "duti"
brew "gitleaks"

# Applications
cask "1password"
cask "antigravity"
cask "claude-code"
cask "gcloud-cli"
cask "anki"
cask "elgato-control-center"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "logi-options+"
cask "obsidian"
cask "postman"
cask "protonvpn"
cask "raycast"
cask "roon"
cask "sublime-text"
cask "transmit"
cask "burp-suite-professional"
cask "zed"

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
